
<%-- *** 전체내용 복붙해서 사용하시면 됩니다 *** --%>
<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8" %>
	
<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core"%>

<!DOCTYPE html>
<html lang="en">
<head>

	<meta charset="utf-8" />
	<meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no" />
	<meta name="description" content="" />
	<meta name="author" content="" />
	<title>** 충청남도 **</title>
	
	<script src="https://code.jquery.com/jquery-3.6.0.min.js"></script>
	<!-- footer css 태준 09/30 -->	
	<link href="/petBill/resources/css/footer.css" rel="stylesheet" type="text/css">	
		
	<style>
		
		@import url('http://fonts.googleapis.com/css?family=Poppins:300,400,500,600,700,800,900&display=swap');
		@import url('https://fonts.googleapis.com/css2?family=Rancho&display=swap');
		
		.bgc {
			background: -webkit-radial-gradient(rgb(255, 255, 255), rgb(214, 248, 255));
			background: radial-gradient(rgb(255, 255, 255), rgb(214, 248, 255));
		}
		
		.mapdiv {
			width: 70%;
			margin: auto;
		}
		
		.mapdiv path {
			fill: rgba(175, 71, 159, 0.5);
		}
		
		.mapdiv path:hover {
			fill: #af479f;
		}
		
		section {
		    position: relative;
		    width: 100%;
		    height: 15vh;
		    display: flex;
		    justify-content: center;
		    align-items: center;
		}
		
		section #text {
		    position: absolute;
		    color: #094b65;
		    font-size: 2vw;
		    text-align: center;
		    font-family: 'Rancho', cursive;
		}
		
		section #text span {
		    font-size: 0.50em;
		    letter-spacing: 2px;
		    font-weight: 400;
		    font-family: 'Poppins', sans-serif;
		}
		
		.OUTLINE {
		    stroke-linejoin:round;
		    stroke: #545454;
		    stroke-width: 1.2px;
		}
		.TEXT {
		    fill: #000000;
		    font-size: 0.8em;
		    /* font-weight: bold; */
		    text-anchor: middle;
		    alignment-baseline: middle;
		}
	    a:link {
	    	text-decoration: none;
	    }
	    
	    
	</style>
	
	<%-- 1. 부트스트랩 css 사용 --%>
	<link href="/petBill/resources/css/styles.css" rel="stylesheet" type="text/css">
	
	</head>
	
	<body>
	
		<div class="d-flex" id="wrapper">
			<%-- 왼쪽 메인 메뉴 --%>
			<div class="border-end bg-white" id="sidebar-wrapper">
				<%-- 로고 --%>
				<div class="sidebar-heading border-bottom bg-light">
					<a href="/petBill/user/main.pet">
						<img src="/petBill/resources/imgs/로고화면.png" style="width: 190px; margin-top: 10px;">
					</a>
				</div>
				<div class="list-group list-group-flush">
					<a class="list-group-item list-group-item-action list-group-item-light p-3" href="/petBill/search/mapMain.pet?petType=${param.petType}">지도 병원검색</a> 
					<a class="list-group-item list-group-item-action list-group-item-light p-3" href="/petBill/search/searchResult.pet?pageNum=1&petType=${param.petType}">시/도 병원검색</a> 
					<a class="list-group-item list-group-item-action list-group-item-light p-3" href="/petBill/hospital/hosCompare.pet?petType=${param.petType}">병원 비교하기</a> 
					<a class="list-group-item list-group-item-action list-group-item-light p-3" href="/petBill/admin/noticeList.pet?petType=${param.petType}">공지사항</a>
				</div>
			</div>
			<%-- Page content wrapper --%>
			<div id="page-content-wrapper">
				<%-- 상단 네비게이션 --%>
				<nav
					class="navbar navbar-expand-lg navbar-light bg-light border-bottom">
					<div class="container-fluid">
						<%-- 반응형 동작시 버튼생김 --%>
						<button class="navbar-toggler" type="button"
							data-bs-toggle="collapse" data-bs-target="#navbarSupportedContent"
							aria-controls="navbarSupportedContent" aria-expanded="false"
							aria-label="Toggle navigation">
							<span class="navbar-toggler-icon"></span>
						</button>
						<div class="collapse navbar-collapse" id="navbarSupportedContent">
							<ul class="navbar-nav ms-auto mt-2 mt-lg-0">
	
								<li>
									<%-- 위치 변경필요할듯 search(검색)form 조장님 수정부분 --%>
									<form action="/petBill/search/searchResult.pet">
										<input type="search" name="search" placeholder="병원명 입력"/>
										<input type="hidden" name="petType" value="${param.petType}"/>
										<input type="submit" value="검색" class="btn btn-secondary btn-sm"/>                 
									</form>
								</li>
	
								<%-- 로그인 분기처리 --%>
								<c:if test="${sessionScope.userId eq 'admin'}">	
		                        	<li class="nav-item active"><a class="nav-link" href="/petBill/user/logoutPro.pet">로그아웃</a></li>
		                       		<li class="nav-item"><a class="nav-link" href="/petBill/admin/adMain.pet">관리자 페이지</a></li>
		                        </c:if>
                                <c:if test="${sessionScope.userId == null && sessionScope.kakaoId == null}">	
		                        	<li class="nav-item active"><a class="nav-link" href="/petBill/user/loginForm.pet">로그인</a></li>
		                       		<li class="nav-item"><a class="nav-link" href="/petBill/user/userSignupForm.pet">회원가입</a></li>
		                        </c:if>
		                        <c:if test="${sessionScope.kakaoId != null ||sessionScope.userId != null && sessionScope.userId ne 'admin'}">
		                        	<li class="nav-item active"><a class="nav-link" href="/petBill/user/logoutPro.pet">로그아웃</a></li>
		                       		<li class="nav-item"><a class="nav-link" href="/petBill/user/userMypage.pet">마이페이지</a></li>
		                        </c:if>
	
								<li class="nav-item dropdown">
									<a class="nav-link dropdown-toggle" id="navbarDropdown" href="#" role="button" data-bs-toggle="dropdown" aria-haspopup="true" aria-expanded="false">검색동물 변경</a>
									<div class="dropdown-menu dropdown-menu-end" aria-labelledby="navbarDropdown">
										<a class="dropdown-item" href="/petBill/search/loc/locSouthChungcheong.pet?petType=${'dog'}&diagnosis=${'dAllTest'}">강아지</a>
                                    	<a class="dropdown-item" href="/petBill/search/loc/locSouthChungcheong.pet?petType=${'cat'}&diagnosis=${'cAllTest'}">고양이</a>
									</div>
								</li>
							</ul>
							<c:if test="${param.petType eq 'dog'}">
                           		<img src="/petBill/resources/imgs/10.png" style="width: 50px; height: 50px">
                            </c:if>
                            <c:if test="${param.petType eq 'cat'}">
                           		<img src="/petBill/resources/imgs/11.png" style="width: 50px; height: 50px">
                            </c:if>									
						</div>
					</div>
				</nav>
	
				<%-- ================================================== 공통 메뉴 구분선 ========================================================== --%>
	
				<%-- 페이지 내용작성 영역 : Page content --%>
				<!-- <div class="container-fluid"> -->
				<div class="bgc">
					
					
					<div>
						<section>
							<h2 id="text"><span>Do not buy a pet and adopt it prudently</span><br>충 청 남 도</h2>
						</section>
					</div>
					
					<div class="mapdiv" id="region">
						
						
						<?xml version="1.0"?>
						<svg xmlns="http://www.w3.org/2000/svg" version="1.2" viewBox="210 0 600 530" >
						
							<defs>
							    <filter id="dropshadow">
							        <feGaussianBlur in="SourceAlpha" stdDeviation="3" />
							        <feOffset dx="2" dy="2" result="offsetblur" />
							        <feMerge>
							            <feMergeNode />
							            <feMergeNode in="SourceGraphic" />
							        </feMerge>
							    </filter>
							</defs> 
							
							<!-- <g filter="url(#dropshadow)"> -->
						
								<a id="cheonan" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=천안시&pageNum=1&petType=${param.petType}">
									<title>천안시 동남구</title>
									<path class="OUTLINE" d="M 690.75 113.76 691.22 114.06 692.1 115.73 691.87 116.13 702.56 122.79 702.82 123.14 707.84 128.07 708.33 128.13 708.68 129.99 708.62 130.04 715.49 147.69 715.49 147.7 715.42 147.72 715.4 147.73 715.34 147.76 712.78 147.81 712.74 147.82 712.72 147.83 712.68 147.85 712.16 148.45 712.11 148.42 712.2 148.59 712.37 148.91 712.33 149.1 712.42 149.32 712.41 149.34 712.38 149.41 712.38 149.42 712.32 149.63 712.28 149.69 710.01 151.65 710.09 151.7 710.12 151.91 709.95 152.15 709.82 152.69 709.77 152.99 709.77 153 709.73 153.06 709.73 153.6 709.69 153.64 709.52 153.72 709.47 153.68 707.88 152.72 707.66 152.75 707.55 152.7 707.24 152.53 706.81 152.33 706.52 152.29 706.49 152.28 706.46 152.15 706.32 151.78 706.25 151.84 705.93 151.08 705.99 150.95 705.99 150.84 705.86 150.65 705.8 150.55 705.56 150.52 705.49 150.39 705.49 150.38 705.59 150.11 705.23 150.08 705.16 150.12 704.95 150.08 703.25 148.67 703.14 148.56 703.13 148.49 703.29 148.41 702.74 146.91 702.63 146.85 702.53 146.8 702.41 146.77 702.32 146.75 702.11 146.94 697.17 147.25 697.15 147.07 697.02 146.93 696.56 146.52 696.56 146.46 696.57 146.16 696.46 145.84 696.46 145.83 696.37 145.83 695.45 146.13 695.26 146.13 695.06 146.13 694.97 146.08 694.9 146.11 694.9 146.11 694.77 146.04 694.69 145.99 694.65 145.96 694.18 146.05 694.03 146.07 693.75 146.05 693.54 146.21 693.51 146.23 693.04 146.54 692.84 146.7 692.36 146.29 692.04 146.11 691.99 146.11 691.13 148.44 691.04 148.46 690.73 148.52 689.5 149.33 689.45 149.33 689.15 149.4 689.08 149.54 688.75 149.61 688.56 149.7 688.49 149.71 688.19 149.9 687.89 149.84 687.69 149.64 686.81 149.67 686.7 149.53 686.49 149.6 686.37 149.64 686.31 149.66 686.16 149.76 686.08 149.78 686.03 149.76 684.99 149.94 684.98 149.96 684.91 149.99 684.21 150.02 684.12 150.07 684.02 149.99 683.98 149.96 682.7 152.81 682.96 152.72 686.34 158.14 686.4 158.24 686.31 158.34 686.1 159.26 686.13 159.36 686.13 159.39 685.2 159.99 685.19 160 685.1 160.27 683.98 160.95 683.94 160.78 681.63 159.28 681.54 159 681.53 158.98 681.34 158.73 681.26 158.65 681.17 158.61 681.09 158.6 680.87 158.56 680.81 158.56 680.48 158.67 680.4 158.69 680.02 158.87 679.84 158.94 679.77 158.97 679.77 158.98 679.21 160.05 679.16 160.08 679.1 160.1 679.07 160.11 678.25 160.81 678.15 160.98 678.13 161.02 677.92 161.36 677.89 161.43 677.79 161.62 677.76 161.67 677.69 161.83 677.67 161.88 677.64 161.95 677.53 162.17 677.5 162.22 677.23 162.37 677.22 162.37 677.2 162.42 677.15 162.57 677 162.95 676.87 163.07 676.83 163.1 676.62 163.24 673.95 163.6 674.05 163.62 674.19 163.63 674.17 163.71 674.13 163.91 672.33 171.02 672.47 171.11 672.81 171.83 672.79 172.08 673.05 172.35 673.02 172.55 673.14 172.59 668.94 175.49 668.95 175.51 665.76 177.39 665.67 177.55 665.37 177.77 665.23 177.98 665.13 178.13 665.1 178.2 664.67 178.53 664.59 178.57 664.41 179.08 664.35 179.26 662.84 179.31 662.78 179.19 650.2 177.14 642.73 170.82 642.67 170.77 635.41 165.97 634.95 165.77 634.97 165.74 634.99 165.7 627.89 161.64 627.89 161.64 612.93 162.45 612.93 162.45 607.66 172.28 607.68 172.29 615.62 176.8 615.63 176.75 616.88 195.42 616.59 195.51 615.7 203.44 615.69 203.45 616.71 209.5 616.75 209.51 616.65 210.55 616.59 210.56 612.96 212.58 609.52 202.47 598.19 194.08 591.53 196.28 591.34 196.47 584.01 202.34 575.41 197.25 559.37 195.1 567.09 179.45 578.16 170.6 585.75 169.75 586.84 158.95 593.4 148.37 593.42 148.35 601.4 143.16 599.29 133.5 610.44 124.92 620.75 106.29 630.72 102.47 642.32 103.52 644.84 96 666.58 84.1 673.13 87.33 672.32 97.72 683.96 101.85 683.03 112.39 690.75 113.76 Z"/>
								</a>	
								<a id="cheonan" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=천안시&pageNum=1&petType=${param.petType}">
									<title>천안시 서북구</title>
									<path class="OUTLINE" d="M 602.12 47.01 622.9 50.85 622.94 50.88 634.51 59.79 634.68 60.08 647.42 71.29 647.73 71.35 660.04 74.62 665.54 83.35 666.58 84.1 644.84 96 642.32 103.52 630.72 102.47 620.75 106.29 610.44 124.92 599.29 133.5 592.44 129.32 594.2 109.75 589.47 98.17 591.63 83.19 591.32 82.94 592.1 74.93 584.57 61.91 588.98 57.72 589.19 57.63 592.25 60.2 592.32 60.19 595.08 50.15 595.1 50.12 596.17 49.15 596.28 49.18 602.12 47.01 Z"/>
								</a>	
								<a id="gongju" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=공주시&pageNum=1&petType=${param.petType}">
									<title>공주시</title>
									<path class="OUTLINE" d="M 543.56 184.17 553.2 198.66 559.37 195.1 575.41 197.25 584.01 202.34 591.34 196.47 591.53 196.28 598.19 194.08 609.52 202.47 612.96 212.58 614.86 218.74 628.36 224.82 628.49 224.82 634.63 232.53 621.29 252.08 624.85 259.35 621.53 269.52 633.39 288.4 632.09 296.57 641.32 305.89 653.61 312.56 662.86 309.58 661.24 342 654.22 350.8 645.63 340.8 634.1 340.99 630.02 347.23 623.49 349.1 609.17 361.12 594.72 347.22 580.44 366.02 580.06 374.19 565.48 371.91 553.85 364.47 553.27 364.39 551.53 349.37 551.37 349.29 546.34 346.64 546.34 346.64 550.24 343.22 552.31 327.48 565 317.49 554.7 288.05 538.45 284.27 528.83 290.19 514.76 278.47 514.49 272.97 514.44 272.23 511.08 262.66 517.11 240.49 519.44 238.02 519.44 238.02 519.62 237.77 519.63 237.77 521.84 235.82 521.87 235.75 521.91 235.67 529.18 217.38 529.24 217.33 529.29 217.27 529.32 217.25 529.77 216.21 529.77 216.2 531.51 214.18 531.52 214.18 531.92 213.89 531.91 213.85 531.9 213.81 535.38 204.69 535.38 204.69 535.38 204.69 535.38 204.68 540.43 187 540.46 186.99 540.58 187.02 541.3 185.98 541.3 185.98 541.3 185.98 541.97 185.57 541.99 185.58 542.27 184.63 542.28 184.6 542.34 184.53 543.56 184.17 Z"/>
								</a>
								<a id="boryeong" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=보령시&pageNum=1&petType=${param.petType}">
									<title>보령시</title>
									<path class="OUTLINE" d="M 358.42 260.65 358.66 260.53 366.53 254.15 379.37 262.98 388.91 264.3 396.96 264.46 396.97 264.46 400.28 264.54 400.32 264.56 402.33 276.64 402.34 276.77 403.44 277.61 408.65 275.69 413.79 278.83 414.7 278.91 422.94 283.29 423.32 283.56 430.21 286.13 435.49 296.24 435.46 296.28 437.39 310.34 442.63 313.05 450.05 327.23 434.33 351.92 437.95 377.19 454.91 384.34 454.91 384.35 454.15 390.25 454.17 390.27 446.99 393.45 445.21 402.97 436.81 414.37 427.14 420.94 402.06 421.21 393.3 419.42 393.02 419.21 389.04 413.19 388.26 412.97 380.64 414.06 378.88 414.3 373.08 415.08 378.56 409.33 375.05 390.9 381.79 376.93 365.38 350.84 380.54 343.72 381.6 335.92 368.15 323.66 358.37 322.94 359.92 308.04 366.74 301.68 357.52 277.82 358.42 260.65 Z"/>
								</a>   
								<a id="asan" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=아산시&pageNum=1&petType=${param.petType}">
									<title>아산시</title>
									<path class="OUTLINE" d="M 584.57 61.91 592.1 74.93 591.32 82.94 591.63 83.19 589.47 98.17 594.2 109.75 592.44 129.32 599.29 133.5 601.4 143.16 593.42 148.35 593.4 148.37 586.84 158.95 585.75 169.75 578.16 170.6 567.09 179.45 559.37 195.1 553.2 198.66 543.56 184.17 543.56 184.13 544.31 177.22 532.77 172.82 532.74 172.79 532.62 172.69 529.72 172.66 529.69 172.69 529.69 172.69 529.68 172.68 529.7 172.65 529.7 172.65 528.61 172.34 528.6 172.35 528.6 172.36 526.75 173.81 526.69 173.79 526.39 173.86 526.34 173.88 526.33 173.88 526.28 173.91 526.25 173.91 525.13 173.05 525.13 173.05 525.12 173.04 521.96 172.54 521.93 172.61 521.93 172.61 521.96 172.64 521.96 172.64 521.92 172.62 521.87 172.72 517.58 166.18 517.58 166.18 507.14 160.94 501.71 153.22 501.72 153.22 502.2 152.53 502.2 152.52 502.19 152.52 501.18 151.14 501.18 151.14 500.96 151.29 500.95 151.3 498.89 150.69 498.88 150.69 498.87 150.68 498.7 150.56 498.7 150.55 498.46 150.45 498.35 150.38 498.32 150.35 498.3 150.31 498.28 149.97 498.28 149.96 498.28 149.95 498.29 149.51 498.29 149.49 498.28 149.41 497.5 148.84 497.49 148.84 497.48 148.85 497.46 148.85 497.43 148.87 497.42 148.87 497.41 148.87 497.4 148.88 496.09 149.58 496.06 149.6 496.03 149.62 496 149.65 495.95 149.68 495.88 149.63 495.65 149.49 495.68 149.43 495.69 149.41 495.69 149.4 495.7 149.39 495.66 149.38 495.64 149.37 495.62 149.37 495.58 149.36 492.83 145.51 492.8 145.5 492.79 145.5 492.31 144.71 492.3 144.69 492.26 144.56 492.26 144.54 491.96 143.56 491.91 143.62 491.9 143.53 491.89 143.49 491.89 143.49 491.88 143.42 491.88 143.38 491.88 143.38 491.88 143.38 491.88 143.36 491.88 143.36 491.88 143.32 491.86 142.82 491.86 142.82 491.85 142.67 491.86 142.68 493.55 133.37 502.2 126.64 500.11 122.56 496.89 116.68 496.86 116.62 496.87 116.23 494.46 112.53 494.23 106.87 495.02 101.81 495.31 100.01 496.85 90.23 497.53 87.1 504.33 89.29 523.11 84.7 522.17 79.06 524.85 76.9 528.62 74.65 533.56 71.7 538.35 70.4 539.82 69.94 543.28 68.69 550.74 64.88 551 64.64 566.25 66.49 584.57 61.91 Z"/>
								</a>   
								<a id="seosan" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=서산시&pageNum=1&petType=${param.petType}">
									<title>서산시</title>
									<path class="OUTLINE" d="M 353.47 29.63 353.49 29.67 353.5 29.7 353.61 29.93 359.93 41.38 361.5 50.07 363.29 58.16 363.23 58.96 363.03 61.56 361.1 67.3 358.19 76.52 356.87 87.41 363.38 91.18 363.69 91.31 367.64 92.49 367.68 92.62 367.66 92.67 368.33 92.68 368.33 92.67 368.34 92.61 368.35 92.56 368.39 92.5 368.43 92.42 368.49 92.37 368.52 92.38 370.18 92.42 370.19 92.42 370.19 92.42 370.3 92.75 370.3 92.77 370.29 92.8 370.29 92.83 370.31 93.13 370.32 93.16 370.33 93.21 370.35 93.28 370.36 93.33 370.37 93.34 372.31 101.55 372.37 101.63 376.85 113.43 377.02 113.47 385.13 113.95 385.44 113.92 397.32 111.56 397.3 111.55 397.41 111.36 397.48 111.26 397.53 111.16 397.67 110.93 397.74 110.81 397.89 110.54 397.93 110.47 397.97 110.41 397.99 110.37 398.08 110.24 398.09 110.21 398.12 110.12 402.57 110.81 402.54 111.32 414.4 119.4 414.47 119.41 417.65 123.58 417.77 123.7 423.13 134.03 423.27 134.26 424.53 138.14 413.43 157.56 404.79 163.88 407.5 171.33 399.48 190.52 388.91 199.47 378.6 198.61 369.83 205.7 369.81 205.72 369.75 205.63 347.57 207.8 342.76 219.73 333.01 212.8 312.23 207.76 309.13 191.37 309.01 190.58 307.2 170.32 307.07 166.99 304.82 153.44 304.79 153.39 306.53 150.28 307.01 148.55 310.25 128.46 310.19 128.36 303.74 117.95 297.96 106.62 301.32 96.24 317.42 98.21 315.21 89.04 327.63 81.33 336.52 61.01 323.42 62.11 318.54 53.83 320.41 39.93 303.49 37.5 311.84 28.31 341.25 24.55 353.47 29.63 Z"/>
								</a>   
								<a id="nonsan" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=논산시&pageNum=1&petType=${param.petType}">
									<title>논산시</title>
									<path class="OUTLINE" d="M 630.02 347.23 633.51 362.84 630.37 373.4 645.54 384.98 647.66 394.96 662.4 389.38 669.91 400.82 675.47 401.09 681.59 418.45 677.29 424.5 678.14 443.67 659.19 454.65 651.05 451.87 647.4 465.15 638.7 459.55 638.54 459.59 638.12 459.22 638.1 459.21 622.72 461.06 622.53 461.41 612.35 462.65 605.71 470.68 605.7 470.69 604.59 474.08 585.91 468.35 577.59 460.68 575.99 445.16 563.5 440.44 557 434.05 550.46 418.68 549.72 405.62 563.97 401.46 571.73 387.47 579.39 384.15 580.06 374.19 580.44 366.02 594.72 347.22 609.17 361.12 623.49 349.1 630.02 347.23 Z"/>
								</a>
								<a id="gyeryong" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=계룡시&pageNum=1&petType=${param.petType}">
									<title>계룡시</title>
									<path class="OUTLINE" d="M 630.02 347.23 634.1 340.99 645.63 340.8 654.22 350.8 653.55 358.9 653.54 358.97 654.1 362.2 649.27 367.85 649.17 367.92 649.77 368.85 649.86 369.32 649.89 369.55 649.97 369.73 650.01 369.78 650.22 369.94 650.25 369.97 650.39 370.07 650.66 370.39 650.72 370.5 650.75 370.6 650.81 370.82 650.82 370.84 651.23 371.44 651.36 371.55 651.83 371.98 651.9 372.13 651.9 372.14 651.98 372.46 652.03 372.6 652.17 372.98 652.28 373.08 652.55 373.52 652.7 373.74 653.17 374.34 653.3 374.52 653.55 374.77 653.61 374.81 654.27 375.1 655.15 375.29 655.28 375.33 655.86 375.57 655.98 375.62 656.3 375.77 656.46 375.9 656.61 376.02 656.86 376.22 657.08 376.5 657.21 376.62 657.59 376.94 657.68 377.04 657.83 377.17 658 377.3 658.22 377.42 658.27 377.45 658.47 377.59 658.74 377.77 659.02 377.94 659.35 378.13 659.6 378.31 660.21 378.72 660.66 378.92 661.17 379.07 661.37 379.22 661.61 379.55 661.68 379.69 661.75 379.78 662.25 380.03 662.69 380.24 662.87 380.27 663.21 380.3 663.44 380.32 663.96 380.31 664.13 380.3 664.38 380.23 664.59 380.13 664.74 380.04 664.86 379.98 665.89 379.84 665.95 379.87 665.99 379.9 666.09 379.97 666.14 380.02 666.3 380.23 666.38 380.36 666.44 380.57 662.4 389.38 647.66 394.96 645.54 384.98 630.37 373.4 633.51 362.84 630.02 347.23 Z"/>
								</a>	
								<a id="dangjin" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=당진시&pageNum=1&petType=${param.petType}">
									<title>당진시</title>
									<path class="OUTLINE" d="M 398.12 110.12 398.09 110.21 398.08 110.24 397.99 110.37 397.97 110.41 397.93 110.47 397.89 110.54 397.74 110.81 397.67 110.93 397.53 111.16 397.48 111.26 397.41 111.36 397.3 111.55 397.32 111.56 385.44 113.92 385.13 113.95 377.02 113.47 376.85 113.43 372.37 101.63 372.31 101.55 370.37 93.34 370.36 93.33 370.35 93.28 370.33 93.21 370.32 93.16 370.31 93.13 370.29 92.83 370.29 92.8 370.3 92.77 370.3 92.75 370.19 92.42 370.19 92.42 370.18 92.42 368.52 92.38 368.49 92.37 368.43 92.42 368.39 92.5 368.35 92.56 368.34 92.61 368.33 92.67 368.33 92.68 367.66 92.67 367.68 92.62 367.64 92.49 363.69 91.31 363.38 91.18 356.87 87.41 358.19 76.52 361.1 67.3 363.03 61.56 363.23 58.96 363.29 58.16 361.5 50.07 359.93 41.38 353.61 29.93 353.5 29.7 353.49 29.67 353.47 29.63 353.18 21.99 366.33 6.35 388.29 14.6 415.66 30.16 441.29 32.19 474.6 45.29 473.06 47.93 486.98 81.4 497.53 87.1 496.85 90.23 495.31 100.01 495.02 101.81 494.23 106.87 494.46 112.53 496.87 116.23 496.86 116.62 496.89 116.68 500.11 122.56 502.2 126.64 493.55 133.37 488.15 133.38 487.47 133.95 480.97 138.38 480.93 138.36 475.14 143.7 474.81 143.97 473.72 144.88 473.72 144.88 470.05 150 458.69 137.06 458.69 137 451.55 127.18 451.22 127.04 447.4 124.83 447.38 124.84 434.07 134.06 433.95 134.05 424.53 138.14 423.27 134.26 423.13 134.03 417.77 123.7 417.65 123.58 414.47 119.41 414.4 119.4 402.54 111.32 402.57 110.81 398.12 110.12 Z"/>
								</a>
								<a id="geumsan" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=금산군&pageNum=1&petType=${param.petType}">
									<title>금산군</title>
									<path class="OUTLINE" d="M 716.28 407.16 726.37 412.53 733.49 400.43 743.16 393.07 758.45 386.96 777.96 396.2 783.49 402.9 783.39 418.11 784.92 429.84 780.25 441.91 789.31 452.59 790.93 461.2 798.85 472.83 799 473.29 792.2 475.06 790.65 496.38 760.41 490.06 760.06 507.07 755.37 512.44 741.29 515.66 729.4 513.29 721.93 500.99 720.9 491.47 708.11 501.26 698.63 494.56 693.96 474.47 688.34 460.37 690.42 454.21 684.76 444.46 678.14 443.67 677.29 424.5 681.59 418.45 694.05 402.02 694.05 386.61 697.24 376.88 704.04 381.56 704.07 392.3 710.8 404.88 716.28 407.16 Z"/>
								</a>
								<a id="buyeo" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=부여군&pageNum=1&petType=${param.petType}">
									<title>부여군</title>
									<path class="OUTLINE" d="M 450.05 327.23 460.96 336.42 476.33 338.02 482.2 326.89 501.32 342.21 502.67 352.49 521.17 350.14 527 356.28 546.34 346.64 551.37 349.29 551.53 349.37 553.27 364.39 553.85 364.47 565.48 371.91 580.06 374.19 579.39 384.15 571.73 387.47 563.97 401.46 549.72 405.62 550.46 418.68 557 434.05 531.16 433.62 523.78 440.39 509.71 442.2 509.64 442.3 506.13 452.49 504.96 470.84 496.26 469.38 491.84 457.51 493.23 449.34 476.29 433.4 475.48 419.07 440 419.41 436.81 414.37 445.21 402.97 446.99 393.45 454.17 390.27 454.15 390.25 454.91 384.35 454.91 384.34 437.95 377.19 434.33 351.92 450.05 327.23 Z"/>
								</a> 
								<a id="seocheon" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=서천군&pageNum=1&petType=${param.petType}">
									<title>서천군</title>
									<path class="OUTLINE" d="M 402.06 421.21 427.14 420.94 436.81 414.37 440 419.41 475.48 419.07 476.29 433.4 493.23 449.34 491.84 457.51 496.26 469.38 504.96 470.84 502.62 475.94 485.73 480.93 482.27 485.9 482.27 485.9 457.64 492.13 455.1 498.63 453.11 504.05 430.14 499.71 423 482.58 413.29 477.63 413.58 465.42 397.95 442.84 389.9 437.29 366.66 432.04 373.2 424.37 373.08 415.08 378.88 414.3 380.64 414.06 388.26 412.97 389.04 413.19 393.02 419.21 393.3 419.42 402.06 421.21 Z"/>
								</a>
								<a id="chyeongyang" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=청양군&pageNum=1&petType=${param.petType}">
									<title>청양군</title>
									<path class="OUTLINE" d="M 430.21 286.13 435.36 282.89 435.5 282.86 446.28 277.02 446.99 276.91 457.56 273.4 457.48 273.18 460.92 266.18 460.92 266.19 469.09 252.09 488.68 254.89 495.01 238.65 499.83 234.71 517.11 240.49 511.08 262.66 514.44 272.23 514.49 272.97 514.76 278.47 528.83 290.19 538.45 284.27 554.7 288.05 565 317.49 552.31 327.48 550.24 343.22 546.34 346.64 546.34 346.64 527 356.28 521.17 350.14 502.67 352.49 501.32 342.21 482.2 326.89 476.33 338.02 460.96 336.42 450.05 327.23 442.63 313.05 437.39 310.34 435.46 296.28 435.49 296.24 430.21 286.13 Z"/>
								</a>
								<a id="hongseoung" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=홍성군&pageNum=1&petType=${param.petType}">
									<title>홍성군</title>
									<path class="OUTLINE" d="M 342.76 219.73 347.57 207.8 369.75 205.63 369.81 205.72 369.83 205.7 378.6 198.61 388.91 199.47 399.48 190.52 398.18 212.01 398.27 212.09 404.16 211.21 404.29 211.55 421.52 197.51 422.44 197.8 429.16 193.38 429.2 193.37 430.67 193.31 430.83 193.29 430.91 193.16 430.99 193.04 431.03 192.99 431.29 192.7 431.44 192.54 444.75 190.35 444.72 190.34 456.9 186.52 455.41 198.1 455.4 198.12 460.68 203.82 460.55 204.36 468.31 213.02 468.34 222.71 468.56 223.17 459.85 230.24 459.83 230.44 459.4 233.05 459.45 233.24 455.74 243.69 455.5 243.83 463.66 255.32 463.69 255.35 469.09 252.09 460.92 266.19 460.92 266.18 457.48 273.18 457.56 273.4 446.99 276.91 446.28 277.02 435.5 282.86 435.36 282.89 430.21 286.13 423.32 283.56 422.94 283.29 414.7 278.91 413.79 278.83 408.65 275.69 403.44 277.61 402.34 276.77 402.33 276.64 400.32 264.56 400.28 264.54 396.97 264.46 396.96 264.46 388.91 264.3 382.83 264.1 365.81 252.34 358.66 260.53 358.42 260.65 360.45 254.81 351.43 245.36 354.38 239.54 348.72 222.25 342.76 219.73 Z"/>
								</a>
								<a id="yesan" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=예산군&pageNum=1&petType=${param.petType}">
									<title>예산군</title>
									<path class="OUTLINE" d="M 447.38 124.84 447.4 124.83 451.22 127.04 451.55 127.18 458.69 137 458.69 137.06 470.05 150 473.72 144.88 473.72 144.88 474.81 143.97 475.14 143.7 480.93 138.36 480.97 138.38 487.47 133.95 488.15 133.38 493.55 133.37 491.86 142.68 491.85 142.67 491.86 142.82 491.86 142.82 491.88 143.32 491.88 143.36 491.88 143.36 491.88 143.38 491.88 143.38 491.88 143.38 491.88 143.42 491.89 143.49 491.89 143.49 491.9 143.53 491.91 143.62 491.96 143.56 492.26 144.54 492.26 144.56 492.3 144.69 492.31 144.71 492.79 145.5 492.8 145.5 492.83 145.51 495.58 149.36 495.62 149.37 495.64 149.37 495.66 149.38 495.7 149.39 495.69 149.4 495.69 149.41 495.68 149.43 495.65 149.49 495.88 149.63 495.95 149.68 496 149.65 496.03 149.62 496.06 149.6 496.09 149.58 497.4 148.88 497.41 148.87 497.42 148.87 497.43 148.87 497.46 148.85 497.48 148.85 497.49 148.84 497.5 148.84 498.28 149.41 498.29 149.49 498.29 149.51 498.28 149.95 498.28 149.96 498.28 149.97 498.3 150.31 498.32 150.35 498.35 150.38 498.46 150.45 498.7 150.55 498.7 150.56 498.87 150.68 498.88 150.69 498.89 150.69 500.95 151.3 500.96 151.29 501.18 151.14 501.18 151.14 502.19 152.52 502.2 152.52 502.2 152.53 501.72 153.22 501.71 153.22 507.14 160.94 517.58 166.18 517.58 166.18 521.87 172.72 521.92 172.62 521.96 172.64 521.96 172.64 521.93 172.61 521.93 172.61 521.96 172.54 525.12 173.04 525.13 173.05 525.13 173.05 526.25 173.91 526.28 173.91 526.33 173.88 526.34 173.88 526.39 173.86 526.69 173.79 526.75 173.81 528.6 172.36 528.6 172.35 528.61 172.34 529.7 172.65 529.7 172.65 529.68 172.68 529.69 172.69 529.69 172.69 529.72 172.66 532.62 172.69 532.74 172.79 532.77 172.82 544.31 177.22 543.56 184.13 543.56 184.17 542.34 184.53 542.28 184.6 542.27 184.63 541.99 185.58 541.97 185.57 541.3 185.98 541.3 185.98 541.3 185.98 540.58 187.02 540.46 186.99 540.43 187 535.38 204.68 535.38 204.69 535.38 204.69 535.38 204.69 531.9 213.81 531.91 213.85 531.92 213.89 531.52 214.18 531.51 214.18 529.77 216.2 529.77 216.21 529.32 217.25 529.29 217.27 529.24 217.33 529.18 217.38 521.91 235.67 521.87 235.75 521.84 235.82 519.63 237.77 519.62 237.77 519.44 238.02 519.44 238.02 517.11 240.49 499.83 234.71 495.01 238.65 488.68 254.89 469.09 252.09 463.69 255.35 463.66 255.32 455.5 243.83 455.74 243.69 459.45 233.24 459.4 233.05 459.83 230.44 459.85 230.24 468.56 223.17 468.34 222.71 468.31 213.02 460.55 204.36 460.68 203.82 455.4 198.12 455.41 198.1 456.9 186.52 444.72 190.34 444.75 190.35 431.44 192.54 431.29 192.7 431.03 192.99 430.99 193.04 430.91 193.16 430.83 193.29 430.67 193.31 429.2 193.37 429.16 193.38 422.44 197.8 421.52 197.51 404.29 211.55 404.16 211.21 398.27 212.09 398.18 212.01 399.48 190.52 407.5 171.33 404.79 163.88 413.43 157.56 424.53 138.14 433.95 134.05 434.07 134.06 447.38 124.84 Z"/>
								</a>
								<a id="taean1" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=태안군&pageNum=1&petType=${param.petType}">
									<title>태안군</title>
									<path class="OUTLINE" d="M 266.34 93.19 267.99 98.26 269.01 96.12 280.27 88.83 289.16 63.87 296.03 75.11 295.88 75.11 296.03 75.11 295.8 85.19 288.08 104.51 291.15 111.45 291.07 111.51 291.15 111.45 301.74 118.59 301.67 118.78 301.74 118.59 303.74 117.95 310.19 128.36 310.25 128.46 307.01 148.55 306.53 150.28 304.79 153.39 304.82 153.44 307.07 166.99 307.2 170.32 309.01 190.58 309.13 191.37 312.23 207.76 303.51 209.98 296.55 222.1 285.33 220.06 285.4 211.99 286.72 211.02 290.12 207.07 290.16 207.12 290.12 207.07 286.09 188.42 276.07 182.41 275.07 174.56 279.91 162.37 264.67 166.25 264.66 166.25 264.67 166.25 257.4 173.86 248.79 182.41 234.78 181.99 232.71 174.34 242.93 164.87 242.77 164.79 242.75 164.76 242.77 164.79 242.93 164.87 254.6 169.18 260.62 161.25 256.26 152.11 239.34 143.77 233.63 152.47 225.21 155.52 227.16 152.2 227.17 152.2 227.16 152.2 223.42 144.47 235.46 118.57 237.94 104.91 237.73 104.82 237.94 104.91 246.89 110.03 252.6 97.64 248.33 91.76 254.33 78.19 266.34 93.19 Z M 303.91 216.47 312.01 214.04 317.43 226.35 316.16 235.71 321.01 259.53 326.22 272.52 326.16 272.47 326.22 272.52 334.49 292.49 334.42 294.34 334.38 294.33 334.42 294.34 335.53 307.91 319.11 304.09 315.6 308.61 301.98 294.65 304.07 283.27 299.4 261.14 299.62 240.21 295.37 231.54 301.24 218.38 303.91 216.47 Z M 228.65 178.58 228.7 178.53 229.69 178.42 229.92 178.45 230.67 178.35 228.65 178.58 Z"/>
								</a> 
									
							<!-- </g> -->
							
								
							<text class="TEXT" id="cheonan" x=630 y="110">
								<a id="cheonan" class="OUTLINE" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=천안시&pageNum=1&petType=${param.petType}">
									천안시
								</a>	
							</text>
							<text class="TEXT" id="asan" x="550" y="140">
								<a id="asan" class="OUTLINE" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=아산시&pageNum=1&petType=${param.petType}">
									아산시
								</a>
							</text>
							
							<text class="TEXT" id="seosan" x="360" y="150">
								<a id="seosan" class="OUTLINE" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=서산시&pageNum=1&petType=${param.petType}">
									서산시
								</a>	
							</text>
							<text class="TEXT" id="dangjin" x="430" y="95">
								<a id="dangjin" class="OUTLINE" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=당진시&pageNum=1&petType=${param.petType}">
									당진시
								</a>
						    </text>
							<text class="TEXT" id="gongju" x="590" y="280">
								<a id="gongju" class="OUTLINE" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=공주시&pageNum=1&petType=${param.petType}">
									공주시
								</a>	
							</text>
							<text class="TEXT" id="nonsan" x="610" y="420">
								<a id="nonsan" class="OUTLINE" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=논산시&pageNum=1&petType=${param.petType}">
									논산시
								</a>
							</text>
							<text class="TEXT" id="boryeong" x="410" y="340">
								<a id="boryeong" class="OUTLINE" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=보령시&pageNum=1&petType=${param.petType}">
									보령시
								</a>
							</text>
							<text class="TEXT" id="gyaeryong" x="663" y="365">
								<a id="gyaeryong" class="OUTLINE" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=계룡시&pageNum=1&petType=${param.petType}">
									계룡시
								</a>	
							</text>
							<text class="TEXT" id="hongseong" x="410" y="240">
								<a id="hongseong" class="OUTLINE" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=홍성군&pageNum=1&petType=${param.petType}">
									홍성군
								</a>
							</text>
							<text class="TEXT" id="yesan" x="480" y="180">
								<a id="yesan" class="OUTLINE" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=예산군&pageNum=1&petType=${param.petType}">
									예산군
								</a>
							</text>
							<text class="TEXT" id="buyeo" x="510" y="395">
								<a id="buyeo" class="OUTLINE" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=부여군&pageNum=1&petType=${param.petType}">
									부여군
								</a>
							</text>
							<text class="TEXT" id="seocheon" x="445" y="455">
								<a id="seocheon" class="OUTLINE" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=서천군&pageNum=1&petType=${param.petType}">
									서천군
								</a>
							</text>
							<text class="TEXT" id="taean" x="275" y="145">
								<a id="taean" class="OUTLINE" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=태안군&pageNum=1&petType=${param.petType}">
									태안군
								</a>
							</text>
							
							<text class="TEXT" class="OUTLINE" id="geumsan" x="735" y="450">
								<a id="geumsan" class="OUTLINE" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=금산군&pageNum=1&petType=${param.petType}">
									금산군
								</a>
							</text>
							
							<text class="TEXT" id="cheongyang" x="500" y="310">
								<a id="cheongyang" class="OUTLINE" href="/petBill/search/searchResult.pet?sidoSel=충청남도&siguSel=청양군&pageNum=1&petType=${param.petType}">
									청양군
								</a>
							</text>
						</svg>
						
					</div>
					<br>
					<div align="center" class="blockquote-footer">
						Copyright (c) 15-January-2021, Author Hyeong-jun Kim<br>
					    <cite title="Source Title">
						    This file is licenced under a Creative Commons license: <br>
						    http://www.gisdeveloper.co.kr/?p=2332
					    </cite>
					</div>
				</div> <%-- container-fluid 내용작성 영역 --%>
			</div> <%-- page-content-wrapper 꺼 --%>
		</div> <%-- wrapper 꺼 --%>
		
	<!-- footer -->
	<footer class="footer">
		<div class="container bottom_border">
			<div class="row">
				<div class=" col-sm-4 col-md col-sm-4  col-12 col">
					<h1 class="headin5_amrc col_white_amrc pt2">🚑𝖕𝖊𝖙𝕭𝖎𝖑𝖑</h1>
				</div>
				
				<div class=" col-sm-4 col-md col-sm-4  col-12 col">
					<h5 class="headin5_amrc col_white_amrc pt2">🐕Bootstrap</h5>
					<!--headin5_amrc-->
					<p class="mb10">http://bootstrapk.com</p>
				</div>
				
				<div class=" col-sm-4 col-md col-sm-4  col-12 col">
					<h5 class="headin5_amrc col_white_amrc pt2">🐈Naver</h5>
					<!--headin5_amrc-->
					<p class="mb10">https://developers.naver.com/main</p>
				</div>
				
				<div class=" col-sm-4 col-md col-sm-4  col-12 col">
					<h5 class="headin5_amrc col_white_amrc pt2">🦮Kakao</h5>
					<!--headin5_amrc-->
					<p class="mb10">https://tableblog.tistory.com/117</p>
					<p class="mb10">https://developers.kakao.com/</p>
				</div>
				
				<div class=" col-sm-4 col-md col-sm-4  col-12 col">
					<h5 class="headin5_amrc col_white_amrc pt2">🐕‍🦺‍Chartjs</h5>
					<!--headin5_amrc-->
				<p class="mb10">https://www.chartjs.org/</p>
				</div>
			</div>
		</div>
		
		<div class="container">
			<ul class="foote_bottom_ul_amrc">
				<li>👨‍⚕️이건우</li>
				<li>👩‍⚕️안혜란</li>
				<li>👨‍⚕️김태준</li>
				<li>👩‍⚕️정샛별</li>
				<li>👨‍⚕️이용훈</li>
			</ul>
		</div>
	</footer>		
		
		<%-- 2. 부트스트랩 core JS --%>
		<script src="https://cdn.jsdelivr.net/npm/bootstrap@5.1.0/dist/js/bootstrap.bundle.min.js"></script>
		<%-- 3. Core theme JS --%>
		<script src="/petBill/resources/js/scripts.js"></script>
	
	</body>
</html>